JohnCallingham/ESP32_2Servo_2Frog_2TOTI_WiFi/src/main.cpp
//==============================================================
// ESP32_2Servo_2Frog_2TOTI_WiFi based on;-
// ESP32_2Frog_WiFi based on;
// ESP32_2TOTI_WiFi based on;-
// Pico_2TOTI_WiFi based on;-
// https://github.com/openlcb/OpenLCB_Single_Thread/tree/master/examples/Pico_8ServoWifiGC
//
// Modified John Callingham 2025, removed servo code and added;-
// - code to read input pins and send events when a change is detected.
// - code to respond to a JMRI query and return the current state of a TOTI.
// MOdified DPH 2024
// Copyright 2019 Alex Shepherd and David Harris
//==============================================================

// Debugging -- uncomment to activate debugging statements:
    // dP(x) prints x, 
    // dPH(x) prints x in hex, 
    // dPS(string,x) prints string and x
#include <Arduino.h>
#include <Wire.h>
#include "credentials.h"
// #include "ESP32WiFiGC_V2.h"
// #include "ESP32WiFiGC_V3.h"
#include "ESP32WiFiGC_V4.h"
#include "servo_lcc.h"
#include "frog.h"
#include "TOTI.h"
#include "crossover.h"
#include "configurationOTA.h"
#include "configurationPreferences.h"
#include "ESPTelnet.h"

ESPTelnet telnet; // Create an instance of the ESPTelnet class

// I2C #defines.
#define I2C_SDA A4
#define I2C_SCL A5

// #define DISPLAY_MEMORY_USED
// #ifdef DISPLAY_MEMORY_USED
//   char displayMemory[100];
// #endif

// #define DEBUG Serial
#define NOCAN

// Board definitions
#define MANU "J Callingham"  // The manufacturer of node
#define MODEL "ESP32_2Servo_2Frog_2TOTI_Wifi" // The model of the board
#define HWVERSION "0.1"   // Hardware version
#define SWVERSION "1.0.9"   // Software version

// To Reset the Node Number, Uncomment and edit the next line
// Need to do this at least once.  
// #define NODE_ADDRESS  5,1,1,1,0x91,0x07  // First servo node.
// #define NODE_ADDRESS  5,1,1,1,0x91,0x08  // Second servo node.
// #define NODE_ADDRESS  5,1,1,1,0x91,0x09  // Third servo node.
#define NODE_ADDRESS  5,1,1,1,0x91,0x00  // Default node ID which will be changed by the remote configuration software.

// Set to 1 to Force Reset EEPROM to Factory Defaults 
// Need to do this at least once.  
#define RESET_TO_FACTORY_DEFAULTS 0

#define NUM_RGB_LED 3 // Red, green and blue.
#define RGB_LED_RED 0 // The index to the RGB_LEDs array.
#define RGB_LED_GREEN 1 // The index to the RGB_LEDs array.
#define RGB_LED_BLUE 2 // The index to the RGB_LEDs array.

#define NUM_SERVO 2
#define NUM_POS 3 // Servos have Thrown, Mid and Closed positions.
#define NUM_CR_POS 2 // Crossover has no Mid position.

#define SERVO_EVENT_BASE 0 // This is the first servo event.
#define NUM_EVENTS_PER_SERVO ((NUM_POS * 4) + 3) // 4 events per position + toggle event + unlock event + locked event
#define NUM_SERVO_EVENT (NUM_EVENTS_PER_SERVO * NUM_SERVO)

#define CROSSOVER_EVENT_BASE (SERVO_EVENT_BASE + NUM_SERVO_EVENT)
#define NUM_CROSSOVER_EVENT ((NUM_CR_POS * 3) + 1) // Add 1 event for the toggle eventID.

#define FROG_EVENT_BASE (CROSSOVER_EVENT_BASE + NUM_CROSSOVER_EVENT) // This is the first frog event.
#define NUM_FROG 2
#define NUM_FROG_EVENT (NUM_FROG * 4) // Each frog has connectJ, disconnectJ, connectK and disconnectK events.

#define TOTI_EVENT_BASE (FROG_EVENT_BASE + NUM_FROG_EVENT) // This is the first TOTI event.
#define NUM_TOTI 2
#define NUM_TOTI_EVENT (NUM_TOTI * 2) // Occupied event and Not Occupied event for each TOTI

#define TEST_EVENT_BASE   ((TOTI_EVENT_BASE) + (NUM_TOTI_EVENT))
#define TEST_EVENT_SERVO1 ((TEST_EVENT_BASE) + 0)
#define TEST_EVENT_SERVO2 ((TEST_EVENT_BASE) + 1)
#define TEST_EVENT_CROSSOVER ((TEST_EVENT_BASE) + 2)
#define TEST_EVENT_FROG1  ((TEST_EVENT_BASE) + 3)
#define TEST_EVENT_FROG2  ((TEST_EVENT_BASE) + 4)
#define TEST_EVENT_TOTI1  ((TEST_EVENT_BASE) + 5)
#define TEST_EVENT_TOTI2  ((TEST_EVENT_BASE) + 6)
#define TEST_EVENT_STOP   ((TEST_EVENT_BASE) + 7)
#define NUM_TEST_EVENT    8 // 7 x test on and 1 x test off.

#define NUM_EVENT (NUM_SERVO_EVENT) + (NUM_CROSSOVER_EVENT) + (NUM_FROG_EVENT) + (NUM_TOTI_EVENT) + (NUM_TEST_EVENT)

#define DESCRIPTION_LENGTH 16

/**
 * Definitions of the LED configuration property values.
 */
#define LED_CONFIG_NOT_CONFIGURED 0
#define LED_CONFIG_HUB_STATE 1
#define LED_CONFIG_SERVO_1_THROWN 2
#define LED_CONFIG_SERVO_1_CLOSED 3
#define LED_CONFIG_SERVO_2_THROWN 4
#define LED_CONFIG_SERVO_2_CLOSED 5
#define LED_CONFIG_CROSSOVER_THROWN 6
#define LED_CONFIG_CROSSOVER_CLOSED 7
#define LED_CONFIG_FROG_1_J_CONNECTED 8
#define LED_CONFIG_FROG_1_K_CONNECTED 9
#define LED_CONFIG_FROG_2_J_CONNECTED 10
#define LED_CONFIG_FROG_2_K_CONNECTED 11
#define LED_CONFIG_TOTI_1_STATE 12
#define LED_CONFIG_TOTI_2_STATE 13

// These have all been changed from 8 bit to 16 bit variables so that the following debounce delay variables, which are 16 bit, are aligned to a 16 bit boundary.
uint16_t ledRedConfiguration;
uint16_t ledGreenConfiguration;
uint16_t ledBlueConfiguration;
bool ledConfigHubConnected = false;

// Forward declarations
//void initialiseServos();
void updateServos();
uint8_t getLEDState(int switchInput);
void logMessageCallbackFunction(const char* format, ...);

/**
 * Configure servos.
 */
#define SERVO_1_PIN A0
#define SERVO_2_PIN A1

// Create two Servo_LCC objects and set their numbers and pins.
Servo_LCC servo0(0, SERVO_1_PIN);
Servo_LCC servo1(1, SERVO_2_PIN);

// Declare an array of pointers to the Servo objects.
Servo_LCC *servo[NUM_SERVO];

/**
 * Configure crossover.
 */
// Create the Crossover object and pass in the address of the servo objects.
Crossover crossover(&servo0, &servo1);

/**
 * Configure frogs.
 */
#define FROG_1_CONNECT_J_PIN D12 // physical pin 30.
#define FROG_1_CONNECT_K_PIN D11 // physical pin 29.
#define FROG_2_CONNECT_J_PIN D10 // physical pin 28.
#define FROG_2_CONNECT_K_PIN D9  // physical pin 27.

// Create two Frog objects and set their pins.
Frog frog0(0, FROG_1_CONNECT_J_PIN, FROG_1_CONNECT_K_PIN);
Frog frog1(1, FROG_2_CONNECT_J_PIN, FROG_2_CONNECT_K_PIN);

// Declare an array of pointers to the Frog objects.
Frog *frog[NUM_FROG];

/**
 * Configure TOTIs.
 */
#define TOTI_1_INPUT_PIN D0 // physical pin 17.
#define TOTI_1_TEST_PIN  D3 // physical pin 21.
#define TOTI_2_INPUT_PIN D1 // physical pin 16.
#define TOTI_2_TEST_PIN  D2 // physical pin 20.

// Create two TOTI objects and set their pins.
TOTI toti0(0, TOTI_1_INPUT_PIN, TOTI_1_TEST_PIN);
TOTI toti1(1, TOTI_2_INPUT_PIN, TOTI_2_TEST_PIN);

// Declare an array of pointers to the TOTI objects.
TOTI *toti[NUM_TOTI];

/**
 * Various #includes from the OpenLCB_Single_Thread library.
 */
#include "mdebugging.h"           // debugging
#include "processor.h"
#include "processCAN.h"
// #include "OpenLCBHeader.h"
#include "OpenLCBHeaderJC.h"

// CDI (Configuration Description Information) in xml, must match MemStruct
// See: http://openlcb.com/wp-content/uploads/2016/02/S-9.7.4.1-ConfigurationDescriptionInformation-2016-02-06.pdf
extern "C" {
    #define N(x) xN(x)     // allow the insertion of the value (x) ..
    #define xN(x) #x       // .. into the CDI string. 

