JohnCallingham/ESP32_2Servo_2Frog_2TOTI_WiFi/src/main.cpp
const char configDefInfo[] PROGMEM =
// ===== Enter User definitions below =====
  CDIheader R"(

    <group replication=')" N(NUM_RGB_LED) R"('>
      <hints><visibility hideable='yes' hidden='yes' ></visibility></hints>
      <name>LED Control</name>
      <repname>Red</repname><repname>Green</repname><repname>Blue</repname>

      <int size='2'>
        <name>LED function</name>
        <default>0</default>
        <map>
          <relation><property>0</property><value>Not configured</value></relation>
          <relation><property>1</property><value>Hub status</value></relation>
          <relation><property>2</property><value>Servo 1 Thrown</value></relation>
          <relation><property>3</property><value>Servo 1 Closed</value></relation>
          <relation><property>4</property><value>Servo 2 Thrown</value></relation>
          <relation><property>5</property><value>Servo 2 Closed</value></relation>
          <relation><property>6</property><value>Crossover Thrown</value></relation>
          <relation><property>7</property><value>Crossover Closed</value></relation>
          <relation><property>8</property><value>Frog 1 Connected to J</value></relation>
          <relation><property>9</property><value>Frog 1 Connected to K</value></relation>
          <relation><property>10</property><value>Frog 2 Connected to J</value></relation>
          <relation><property>11</property><value>Frog 2 Connected to K</value></relation>
          <relation><property>12</property><value>TOTI 1 status</value></relation>
          <relation><property>13</property><value>TOTI 2 status</value></relation>
        </map>
      </int>
    </group>

    <group>
      <hints><visibility hideable='yes' hidden='yes'></visibility></hints>
      <name>Servo Speed</name>
      <int size='2'>
        <name>Servo Delay</name>
        <description>This is the number of milli seconds between each degree of movement</description>
        <min>0</min><max>250</max>
        <hints><slider tickSpacing='50' immediate='yes' showValue='true'></slider></hints>
      </int>
    </group>

    <group replication=')" N(NUM_SERVO) R"('>
        <hints><visibility hideable='yes' hidden='yes' ></visibility></hints>
        <name>Servos</name>
        <repname>1</repname>
        <string size='16'><name>Description</name></string>
        <int size='1'>
          <name>Initial position</name>
          <default>1</default>
          <map>
            <relation><property>0</property><value>Thrown</value></relation>
            <relation><property>1</property><value>Mid</value></relation>
            <relation><property>2</property><value>Closed</value></relation>
          </map>
          <hints><radiobutton/></hints>
        </int>
        <group replication=')" N(NUM_POS) R"('>
            <name>Positions</name>
            <repname>Thrown</repname><repname>Mid</repname><repname>Closed</repname>
            <!-- <string size=')" N(DESCRIPTION_LENGTH) R"('><name>Description</name></string> -->
            <int size='1'>
              <name>Servo Position in Degrees</name>
              <min>0</min><max>180</max>
              <hints><slider tickSpacing='45' immediate='yes' showValue='true'></slider></hints>
            </int>
            <eventid>
              <name>Unconditional move event</name>
              <description>Receiving this event starts this servo moving to this position regardless of its locked state</description>
            </eventid>
            <eventid>
              <name>Conditional move event</name>
              <description>Receiving this event moves this servo to this position if it is not locked</description>
            </eventid>
            <eventid>
              <name>Reached event</name>
              <description>This event will be sent when this servo reaches this position</description>
            </eventid>
            <eventid>
              <name>Leaving event</name>
              <description>This event will be sent when this servo leaves this position</description>
            </eventid>
        </group>
        <eventid>
          <name>Toggle event</name>
          <description>Receiving this event starts this servo moving to the other end</description>
        </eventid>
        <eventid>
          <name>Unlock event</name>
          <description>Receiving this event resets the locked flag for this servo</description>
        </eventid>
        <eventid>
          <name>Locked event</name>
          <description>This event will be sent when this servo is locked and it receives a conditional move event</description>
        </eventid>
    </group>

    <group>
        <hints><visibility hideable='yes' hidden='yes' ></visibility></hints>
        <name>Crossover</name>
        <string size='16'><name>Description</name></string>
        <group replication=')" N(NUM_CR_POS) R"('>
            <name>Positions</name>
            <repname>Thrown</repname><repname>Closed</repname>
            <!-- <string size=')" N(DESCRIPTION_LENGTH) R"('><name>Description</name></string> -->
            <eventid>
              <name>Move event</name>
              <description>Receiving this event starts the crossover moving to this position</description>
            </eventid>
            <eventid>
              <name>Reached event</name>
              <description>This event will be sent when the crossover reaches this position</description>
            </eventid>
            <eventid>
              <name>Leaving event</name>
              <description>This event will be sent when the crossover leaves this position</description>
            </eventid>
        </group>
        <eventid>
          <name>Toggle event</name>
          <description>Receiving this event starts the crossover moving to the other end</description>
        </eventid>
    </group>

    <group replication=')" N(NUM_FROG) R"('>
        <hints><visibility hideable='yes' hidden='yes' ></visibility></hints>
        <name>Frogs</name>
        <repname>1</repname>
        <string size=')" N(DESCRIPTION_LENGTH) R"('><name>Description</name></string>
        <eventid>
          <name>Connect Frog to J</name>
          <description>Receiving this event causes this frog to be connected to the J wire.</description>
        </eventid>
        <eventid>
          <name>Disconnect Frog from J</name>
          <description>Receiving this event causes this frog to be disconnected from the J wire.</description>
        </eventid>
        <eventid>
          <name>Connect Frog to K</name>
          <description>Receiving this event causes this frog to be connected to the K wire.</description>
        </eventid>
        <eventid>
          <name>Disconnect Frog from K</name>
          <description>Receiving this event causes this frog to be disconnected from the K wire.</description>
        </eventid>
    </group>

