JohnCallingham/ESP32_2Servo_2Frog_2TOTI_WiFi/src/main.cpp
    <group replication=')" N(NUM_TOTI) R"('>
        <hints><visibility hideable='yes' hidden='yes' ></visibility></hints>
        <name>TOTIs</name>
        <repname>1</repname>
        <string size=')" N(DESCRIPTION_LENGTH) R"('><name>Description</name></string>
        <int size='2'>
          <name>Occupied Delay</name>
          <description>The number of mS that this TOTI should permanently indicate occupied before the occupied event is sent.</description>
          <min>0</min><max>5000</max>
          <hints><slider tickSpacing='1000' immediate='yes' showValue='true'></slider></hints>
        </int>
        <int size='2'>
          <name>Not Occupied Delay</name>
          <description>The number of mS that this TOTI should permanently indicate not occupied before the not occupied event is sent.</description>
          <min>0</min><max>5000</max>
          <hints><slider tickSpacing='1000' immediate='yes' showValue='true'></slider></hints>
        </int>
        <eventid>
          <name>Occupied</name>
          <description>This event will be sent when the occupied delay expires.</description>
        </eventid>
        <eventid>
          <name>Not Occupied</name>
          <description>This event will be sent when the not occupied delay expires.</description>
        </eventid>
    </group>

    <group>
      <hints><visibility hideable='yes' hidden='yes' ></visibility></hints>
      <name>Testing</name>
      <eventid>
        <name>Start testing Servo 1</name>
        <description>Receiving this event starts the Servo 1 testing cycle.</description>
      </eventid>
      <eventid>
        <name>Start testing Servo 2</name>
        <description>Receiving this event starts the Servo 2 testing cycle.</description>
      </eventid>
      <eventid>
        <name>Start testing Crossover</name>
        <description>Receiving this event starts the Crossover testing cycle.</description>
      </eventid>
      <eventid>
        <name>Start testing Frog 1</name>
        <description>Receiving this event starts the Frog 1 testing cycle.</description>
      </eventid>
      <eventid>
        <name>Start testing Frog 2</name>
        <description>Receiving this event starts the Frog 2 testing cycle.</description>
      </eventid>
      <eventid>
        <name>Start testing TOTI 1</name>
        <description>Receiving this event starts the TOTI 1 testing cycle.</description>
      </eventid>
      <eventid>
        <name>Start testing TOTI 2</name>
        <description>Receiving this event starts the TOTI 2 testing cycle.</description>
      </eventid>
      <eventid>
        <name>Stop all testing</name>
        <description>Receiving this event stops all of the board testing cycles.</description>
      </eventid>
    </group>

  )" CDIfooter;
// ===== Enter User definitions above =====
} // end extern

// ===== MemStruct =====
//   Memory structure of EEPROM, must match CDI above
typedef struct { 
  EVENT_SPACE_HEADER eventSpaceHeader; // MUST BE AT THE TOP OF STRUCT - DO NOT REMOVE!!!
  
  char nodeName[20];  // optional node-name, used by ACDI
  char nodeDesc[24];  // optional node-description, used by ACDI
  // ===== Enter User definitions below =====

  struct {
    uint16_t ledConfiguration; // Changed from 8 bit to 16 bit so that all variables align to a 16 bit boundary.
  } RGB_LEDs[NUM_RGB_LED];

  uint16_t delaymS;  // Changed from 8 bit to 16 bit so that all variables align to a 16 bit boundary.

  struct {
    char servodesc[DESCRIPTION_LENGTH];        // description of this Servo Turnout Driver
    uint8_t initialPosition;
    struct {
      //char positiondesc[DESCRIPTION_LENGTH];      // description of this Servo Position
      uint8_t pos;      // angle for this position
      EventID eid;      // eventID consumed to move to this position unconditionally
      EventID cid;      // eventID consumed to move to this position conditionally (Check, Lock and Move)
      EventID rid;      // eventID produced when position reached
      EventID lid;      // eventID produced when position left
    } pos[NUM_POS];
    EventID tid;        // eventID consumed to toggle position
    EventID uid;        // eventID consumed to unlock
    EventID kid;        // eventID produced when a locked servo receives a conditional move event
  } servos[NUM_SERVO];

  struct {
    char crossoverdesc[DESCRIPTION_LENGTH];        // description of this Crossover
    struct {
      // char positiondesc[DESCRIPTION_LENGTH];      // description of this Crossover Position
      EventID eid;      // eventID consumed to move to this position
      // EventID cid;      // eventID consumed to move to this position conditionally (Check, Lock and Move)
      EventID rid;      // eventID produced when position reached
      EventID lid;      // eventID produced when position left
    } pos[NUM_CR_POS];
    EventID tid;        // eventID consumed to toggle position
  } crossover;

  struct {
    char frogdesc[DESCRIPTION_LENGTH];        // description of this Frog
    EventID eidConnectJ;
    EventID eidDisconnectJ;
    EventID eidConnectK;
    EventID eidDisconnectK;
  } Frogs[NUM_FROG];

  struct {
    char totidesc[DESCRIPTION_LENGTH];        // description of this TOTI
    uint16_t occupiedDelay;
    uint16_t notOccupiedDelay;
    EventID eidON;
    EventID eidOFF;
  } TOTIs[NUM_TOTI];

  EventID testStartServo1;
  EventID testStartServo2;
  EventID testStartCrossover;
  EventID testStartFrog1;
  EventID testStartFrog2;
  EventID testStartTOTI1;
  EventID testStartTOTI2;
  EventID testAllStop;

  // ===== Enter User definitions above =====
} MemStruct;       // type definition

extern "C" {
    // ===== eventid Table =====
    // useful macro to help fill the table

    // each servo position has 4 eventIDs
    #define REG_POS(s,p) CEID(servos[s].pos[p].eid), CEID(servos[s].pos[p].cid), PEID(servos[s].pos[p].rid), PEID(servos[s].pos[p].lid)  

    // each servo has three positions + toggle eventID + unlock eventID + locked eventID
    #define REG_SERVO(s) REG_POS(s,0), REG_POS(s,1), REG_POS(s,2), CEID(servos[s].tid), CEID(servos[s].uid), PEID(servos[s].kid)

    // each crossover position has 3 event IDs
    #define REG_POS_CR(p) CEID(crossover.pos[p].eid), PEID(crossover.pos[p].rid), PEID(crossover.pos[p].lid)  

    // the crossover has two positions and a toggle eventID
    #define REG_CROSSOVER REG_POS_CR(0), REG_POS_CR(1), CEID(crossover.tid)

