JohnCallingham/ESP32_2Servo_2Frog_2TOTI_WiFi/src/main.cpp
    #define REG_FROG(s) CEID(Frogs[s].eidConnectJ), CEID(Frogs[s].eidDisconnectJ), CEID(Frogs[s].eidConnectK), CEID(Frogs[s].eidDisconnectK)

    #define REG_TOTI(s) PEID(TOTIs[s].eidON), PEID(TOTIs[s].eidOFF)
    
    //  Array of the offsets to every eventID in MemStruct/EEPROM/mem, and P/C flags
    const EIDTab eidtab[NUM_EVENT] PROGMEM = {
      REG_SERVO(0), REG_SERVO(1),
      REG_CROSSOVER,
      REG_FROG(0), REG_FROG(1),
      REG_TOTI(0), REG_TOTI(1),
      CEID(testStartServo1), CEID(testStartServo2),
      CEID(testStartCrossover),
      CEID(testStartFrog1), CEID(testStartFrog2),
      CEID(testStartTOTI1), CEID(testStartTOTI2),
      CEID(testAllStop)
    };
    
    // SNIP Short node description for use by the Simple Node Information Protocol
    // See: http://openlcb.com/wp-content/uploads/2016/02/S-9.7.4.3-SimpleNodeInformation-2016-02-06.pdf
    // extern const char SNII_const_data[] PROGMEM = "\001" MANU "\000" MODEL "\000" HWVERSION "\000" OlcbCommonVersion ; // last zero in double-quote
    extern const char SNII_const_data[] PROGMEM = "\001" MANU "\000" MODEL "\000" HWVERSION "\000" SWVERSION ; // last zero in double-quote
} // end extern "C"

// PIP Protocol Identification Protocol uses a bit-field to indicate which protocols this node supports
// See 3.3.6 and 3.3.7 in http://openlcb.com/wp-content/uploads/2016/02/S-9.7.3-MessageNetwork-2016-02-06.pdf
uint8_t protocolIdentValue[6] = {   //0xD7,0x58,0x00,0,0,0};
        pSimple | pDatagram | pMemConfig | pPCEvents | !pIdent    | pTeach     | !pStream   | !pReservation, // 1st byte
        pACDI   | pSNIP     | pCDI       | !pRemote  | !pDisplay  | !pTraction | !pFunction | !pDCC        , // 2nd byte
        0, 0, 0, 0                                                                                           // remaining 4 bytes
    };

#define OLCB_NO_BLUE_GOLD

// This is called to initialize the EEPROM during Factory Reset.
void userInitAll()
{
  NODECONFIG.put(EEADDR(nodeName), ESTRING("ESP32"));
  NODECONFIG.put(EEADDR(nodeDesc), ESTRING("2Servo_2Frog_2TOTI_WiFi"));

  NODECONFIG.update16(EEADDR(RGB_LEDs[RGB_LED_RED].ledConfiguration), LED_CONFIG_NOT_CONFIGURED); // The red LED default is not configured.
  NODECONFIG.update16(EEADDR(RGB_LEDs[RGB_LED_GREEN].ledConfiguration), LED_CONFIG_NOT_CONFIGURED); // The green LED default is not configured.
  NODECONFIG.update16(EEADDR(RGB_LEDs[RGB_LED_BLUE].ledConfiguration), LED_CONFIG_HUB_STATE); // The blue LED default is to show the hub connection status.

  // NODECONFIG.put(EEADDR(delaymS), (uint8_t) 25); // Default to 25 mS.
  // NODECONFIG.update(EEADDR(delaymS), 25); // Default to 25 mS.
  NODECONFIG.update16(EEADDR(delaymS), 25); // Default to 25 mS.

  for(uint8_t i = 0; i < NUM_SERVO; i++) {
    NODECONFIG.put(EEADDR(servos[i].servodesc), ESTRING(""));

    // Set all servos' initial position to Mid.
    // NODECONFIG.put(EEADDR(servos[i].initialPosition), (uint8_t) 1);
    NODECONFIG.update(EEADDR(servos[i].initialPosition), 1);

    // Factory reset positions.
    // NODECONFIG.put(EEADDR(servos[i].pos[0].pos), (uint8_t) 80); // Thrown
    // NODECONFIG.put(EEADDR(servos[i].pos[1].pos), (uint8_t) 90); // Mid point
    // NODECONFIG.put(EEADDR(servos[i].pos[2].pos), (uint8_t) 100); // Closed
    NODECONFIG.update(EEADDR(servos[i].pos[0].pos), 80); // Thrown
    NODECONFIG.update(EEADDR(servos[i].pos[1].pos), 90); // Mid point
    NODECONFIG.update(EEADDR(servos[i].pos[2].pos), 100); // Closed
  }

  NODECONFIG.put(EEADDR(crossover.crossoverdesc), ESTRING(""));

  // Set the default debounce delay for all TOTIs to 100 mS.
  for (uint8_t i=0; i<NUM_TOTI; i++) {
    NODECONFIG.update16(EEADDR(TOTIs[i].occupiedDelay), 100);
    NODECONFIG.update16(EEADDR(TOTIs[i].notOccupiedDelay), 100);
  }
}

/**
 * userState() is called when JMRI queries the state of an event index.
 */
uint8_t userState(uint16_t index) {
  enum evStates { VALID=4, INVALID=5, UNKNOWN=7 };
  uint8_t retVal = evStates::UNKNOWN;

  Serial.printf("\n%6ld In userState() for event index = 0x%02X, returning ", millis(), index);

  // Determine if a Servo object has this event index.
  for (uint8_t i=0; i<NUM_SERVO; i++) {
    if (servo[i]->eventIndexMatches(index)) {
      // This servo has this event index.
      // return servo[i]->eventIndexMatchesCurrentState(index) ? VALID : INVALID;
      retVal = servo[i]->eventIndexMatchesCurrentState(index) ? VALID : INVALID;
    }
  }

  // Determine if the Crossover object has this event index.
  if (crossover.eventIndexMatches(index)) {
    // The crossover object has this event index.
    // return crossover.eventIndexMatchesCurrentState(index) ? VALID : INVALID;
    retVal = crossover.eventIndexMatchesCurrentState(index) ? VALID : INVALID;
  }

  // Determine if a Frog object has this event index.
  for (uint8_t i=0; i<NUM_FROG; i++) {
    if (frog[i]->eventIndexMatches(index)) {
      // This Frog object has this event index.
      // return frog[i]->eventIndexMatchesCurrentState(index) ? VALID : INVALID;
      retVal = frog[i]->eventIndexMatchesCurrentState(index) ? VALID : INVALID;
    }
  }

  // Determine if a TOTI object has this event index.
  for (uint8_t i=0; i<NUM_TOTI; i++) {
    if (toti[i]->eventIndexMatches(index)) {
      // This TOTI object has this event index.
      // return toti[i]->eventIndexMatchesCurrentState(index) ? VALID : INVALID;
      retVal = toti[i]->eventIndexMatchesCurrentState(index) ? VALID : INVALID;
    }
  }

  switch (retVal) {
    case evStates::VALID:
      Serial.print("VALID");
      break;
    
    case evStates::INVALID:
      Serial.print("INVALID");
      break;
    
    case evStates::UNKNOWN:
      Serial.print("UNKNOWN");
      break;
  }
  return retVal;
}

// ===== Process Consumer-eventIDs =====
void pceCallback(uint16_t index) {
  // Invoked when an event is consumed; drive pins as needed
  // from index of all events.
  Serial.printf("\n%6ld pceCallback() called with index=0x%02X", millis(), index);

  // Determine if this event index is for one of the Servo objects.
  for (uint8_t i=0; i<NUM_SERVO; i++) {
    if (servo[i]->eventIndexMatches(index)) {
      // This Servo object has this event index.
      Serial.printf("\n%6ld index 0x%02X belongs to servo %d", millis(), index, i);

      // Drive the servo as required.
      // Serial.printf("\ncalling eventReceived()");
      servo[i]->eventReceived(index);
    }
  }

