JohnCallingham/ESP32_2Servo_2Frog_2TOTI_WiFi/src/main.cpp
  // Determine if this event index is for the Crossover object.
  if (crossover.eventIndexMatches(index)) {
    // The Crossover object has this event index.
    Serial.printf("\n%6ld index 0x%02X belongs to the crossover", millis(), index);

    // Drive the crossover as required.
    crossover.eventReceived(index);
  }

  // Determine if this event index is for one of the Frog objects.
  for (uint8_t i=0; i<NUM_FROG; i++) {
    if (frog[i]->eventIndexMatches(index)) {
      // This Frog object has this event index.
      Serial.printf("\n%6ld index 0x%02X belongs to frog %d", millis(), index, i);

      // Set the frog's pins as required.
      frog[i]->eventReceived(index);
    }
  }

  // Determine if this event index is for one of the TOTI objects.
  // Only used for the test start and test stop events.
  for (uint8_t i=0; i<NUM_TOTI; i++) {
    if (toti[i]->eventIndexMatches(index)) {
      // This TOTI object has this event index.
      Serial.printf("\n%6ld index 0x%02X belongs to TOTI %d", millis(), index, i);

      // Only used for the test start and test stop events.
      toti[i]->eventReceived(index);
    }
  }
}

void userSoftReset() {}
void userHardReset() {}


// Callback from a Configuration write
// Use this to detect changes in the node's configuration
// This may be useful to take immediate action on a change.
void userConfigWritten(uint32_t address, uint16_t length, uint16_t func) {
  dPS("\nuserConfigWritten: Addr: ", (uint32_t)address); 
  dPS("  Len: ", (uint16_t)length); 
  dPS("  Func: ", (uint8_t)func);

  // Need to do an EEPROM commit as this doesn't always appear to happen!!
  EEPROM.commit();

  // Update the LED's configuration as it may have been changed.
  ledRedConfiguration = NODECONFIG.read16(EEADDR(RGB_LEDs[RGB_LED_RED].ledConfiguration));
  ledGreenConfiguration = NODECONFIG.read16(EEADDR(RGB_LEDs[RGB_LED_GREEN].ledConfiguration));
  ledBlueConfiguration = NODECONFIG.read16(EEADDR(RGB_LEDs[RGB_LED_BLUE].ledConfiguration));

  // Update the speed for all servos.
  for (int s=0; s<NUM_SERVO; s++) {
    // servo[s]->updateDelaymS((long) NODECONFIG.read(EEADDR(delaymS)));
    servo[s]->updateDelaymS((long) NODECONFIG.read16(EEADDR(delaymS)));
  }

  // Find the servo and position which has been changed.
  for(int s=0; s<NUM_SERVO; s++) {
    for(int p=0; p<NUM_POS; p++) {
      if(address == EEADDR(servos[s].pos[p].pos)) {
        // Find the new angle for this servo's position.
        uint8_t servoPosDegrees = NODECONFIG.read(EEADDR(servos[s].pos[p].pos)); 

        Serial.printf("\nsetting servo %d, position %d to angle %d", s, p, servoPosDegrees);

        updateServos();

        // Move the servo to this angle.
        servo[s]->servoEasing.moveTo(servoPosDegrees); // Uses no easing.

        break; // === Does this break out of both for loops ??? ===
      }
    }
  }

  // Update the TOTI's delay as they may have changed.
  for (uint8_t i=0; i<NUM_TOTI; i++) {
    toti[i]->setOccupiedDebounceDelay(NODECONFIG.read16(EEADDR(TOTIs[i].occupiedDelay)));
    toti[i]->setNotOccupiedDebounceDelay(NODECONFIG.read16(EEADDR(TOTIs[i].notOccupiedDelay)));
  }
}

void sendInitialEvents() {
  for (uint8_t i=0; i<NUM_SERVO; i++) {
    servo[i]->sendEventsForCurrentState();
  }

  crossover.sendEventsForCurrentState();

  for (uint8_t i=0; i<NUM_TOTI; i++) {
    toti[i]->sendEventsForCurrentState();
  }
}

void sendEventCallbackFunction(uint16_t eventIndexToSend) {
  if (hubConnected) {
    Serial.printf("\n%6ld sendEventCallbackFunction() called. event index=0x%02X", millis(), eventIndexToSend);
    OpenLcb.produce(eventIndexToSend);
  }
}

void reachedAngleCallbackFunction(uint8_t servoNumber, uint8_t currentAngle, ServoEasing::AngleDirection direction) {
  Serial.printf("\n%6ld reachedAngleCallbackFunction() called. servoNumber=%d, currentAngle=%d", millis(), servoNumber, currentAngle);

  // Pass this data back to the Servo_LCC object so that it can send the appropriate event.
  servo[servoNumber]->handleReachedAngle(currentAngle, direction);
}

/**
 * Called when a configuration change is made to the servo angles.
 * TO DO: only need to update the one position which has been changed.
 */
void updateServos() {
  for (uint8_t i=0; i<NUM_SERVO; i++) {
    for (uint8_t j=0; j<NUM_POS; j++) {
      servo[i]->updatePosition(j, NODECONFIG.read(EEADDR(servos[i].pos[j].pos)));
    }
  }
}

void initialiseRGBLEDs() {
  // Configure the built in RGB LEDs and turn them off.
  pinMode(LED_RED, OUTPUT);
  digitalWrite(LED_RED, HIGH);
  pinMode(LED_GREEN, OUTPUT);
  digitalWrite(LED_GREEN, HIGH);
  pinMode(LED_BLUE, OUTPUT);
  digitalWrite(LED_BLUE, HIGH);

  // Determine how the RGB LEDs are configured.
  ledRedConfiguration = NODECONFIG.read16(EEADDR(RGB_LEDs[RGB_LED_RED].ledConfiguration));
  ledGreenConfiguration = NODECONFIG.read16(EEADDR(RGB_LEDs[RGB_LED_GREEN].ledConfiguration));
  ledBlueConfiguration = NODECONFIG.read16(EEADDR(RGB_LEDs[RGB_LED_BLUE].ledConfiguration));
}

void initialiseServos() {
  // Store pointers to the Servo objects in the servo array.
  servo[0] = &servo0;
  servo[1] = &servo1;

  // Initialise all Servo_LCC objects.
  for (uint8_t i=0; i<NUM_SERVO; i++) {
    // servo[i]->updateDelaymS((long) NODECONFIG.read(EEADDR(delaymS)));
    servo[i]->updateDelaymS((long) NODECONFIG.read16(EEADDR(delaymS)));

    for (uint8_t j=0; j<NUM_POS; j++) {
      servo[i]->addPosition(
            j,
            "", // to be changed.
            NODECONFIG.read(EEADDR(servos[i].pos[j].pos)),
            // 4 events per position
            // 3 positions = 12 events
            // Add one for the servo toggle, one for unlock, one for locked.
            // Total of 15 events per servo
            SERVO_EVENT_BASE + (i*15) + (j*4) + 0,
            SERVO_EVENT_BASE + (i*15) + (j*4) + 1,
            SERVO_EVENT_BASE + (i*15) + (j*4) + 2,
            SERVO_EVENT_BASE + (i*15) + (j*4) + 3);
      servo[i]->setEventToggle(SERVO_EVENT_BASE + (i*15) + 12);
      servo[i]->setEventUnLock(SERVO_EVENT_BASE + (i*15) + 13);
      servo[i]->setEventLocked(SERVO_EVENT_BASE + (i*15) + 14);
    }

    // Set the current and mid angles to position 1 (Mid) for this servo.
    // Causes the servo to snap to this angle on startup.
    servo[i]->setInitialAngles(NODECONFIG.read(EEADDR(servos[i].pos[1].pos)));

    // Set the target angle to the initial position.
    // Causes the servo to ease to this position on startup.
    servo[i]->setInitialPosition(NODECONFIG.read(EEADDR(servos[i].initialPosition)));

    // Set the same call back function for all leaving event sending.
    servo[i]->setSendEventCallbackFunction(sendEventCallbackFunction);

    // Set the call back functions for all reached event sending.
    servo[i]->servoEasing.setReachedAngleCallbackFunction(reachedAngleCallbackFunction);

    // Set the call back functions for all log message sending.
    servo[i]->setLogMessageCallbackFunction(logMessageCallbackFunction);

    servo[i]->setTestStopEventIndex(TEST_EVENT_STOP);

