JohnCallingham/ESP32_2Servo_2Frog_2TOTI_WiFi/src/main.cpp
    // servo[i]->print();
  }

  // Initialise the servo testing events.
  servo[0]->setTestStartEventIndex(TEST_EVENT_SERVO1);
  servo[1]->setTestStartEventIndex(TEST_EVENT_SERVO2);
}

void initialiseCrossover() {
  // Add position 0 (Thrown).
  crossover.addPosition(
        POS_CR_THROWN, "Thrown",
        CROSSOVER_EVENT_BASE + 0,
        // CROSSOVER_EVENT_BASE + 1,
        // CROSSOVER_EVENT_BASE + 2,
        // CROSSOVER_EVENT_BASE + 3);
        CROSSOVER_EVENT_BASE + 1,
        CROSSOVER_EVENT_BASE + 2);

  // Add position 1 (Closed).
  crossover.addPosition(
        POS_CR_CLOSED, "Closed", // TO DO: Changed from POS_CLOSED. To be tested.
        // POS_CLOSED, "Closed", // TO DO: Changed from POS_CLOSED. To be tested.
        // CROSSOVER_EVENT_BASE + 4,
        // CROSSOVER_EVENT_BASE + 5,
        // CROSSOVER_EVENT_BASE + 6,
        // CROSSOVER_EVENT_BASE + 7);
        CROSSOVER_EVENT_BASE + 3,
        // CROSSOVER_EVENT_BASE + 4,
        CROSSOVER_EVENT_BASE + 4,
        CROSSOVER_EVENT_BASE + 5);
  
  // Add position 2 (Unknown).
  crossover.addPosition(
        POS_CR_UNKNOWN, "Unknown",
        0, 0, 0); // would be better if these were 0xFFFF
  
  // Set the initial position to Unknown.
  crossover.setInitialPosition(POS_CR_UNKNOWN);

  crossover.setEventToggle(CROSSOVER_EVENT_BASE + 6);

  crossover.setSendEventCallbackFunction(sendEventCallbackFunction);

  crossover.setTestStartEventIndex(TEST_EVENT_CROSSOVER);
  crossover.setTestStopEventIndex(TEST_EVENT_STOP);
}

void initialiseFrogs() {
  // Store pointers to the Frog objects in the frog array.
  frog[0] = &frog0;
  frog[1] = &frog1;

  // Initialise all Frog objects.
  for (uint8_t i=0; i<NUM_FROG; i++) {
    frog[i]->initialise();
    frog[i]->setDelaymS(100); // The time that both J and K are disconnected when changing from one to the other.
    frog[i]->setEvents(FROG_EVENT_BASE + (i*4) + 0,
                      FROG_EVENT_BASE + (i*4) + 1,
                      FROG_EVENT_BASE + (i*4) + 2,
                      FROG_EVENT_BASE + (i*4) + 3);
    frog[i]->setTestStopEventIndex(TEST_EVENT_STOP);

    // frog[i]->print();
  }

  // Initialise the frog testing events.
  frog[0]->setTestStartEventIndex(TEST_EVENT_FROG1);
  frog[1]->setTestStartEventIndex(TEST_EVENT_FROG2);
}

void initialiseTOTIs() {
  // Store pointers to the TOTI objects in the toti array.
  toti[0] = &toti0;
  toti[1] = &toti1;

  // Initialise all TOTI objects.
  for (uint8_t i=0; i<NUM_TOTI; i++) {
    toti[i]->setEvents(TOTI_EVENT_BASE + (i*2) + 0, TOTI_EVENT_BASE + (i*2) + 1);
    toti[i]->setSendEventCallbackFunction(sendEventCallbackFunction);

    toti[i]->setOccupiedDebounceDelay(NODECONFIG.read16(EEADDR(TOTIs[i].occupiedDelay)));
    toti[i]->setNotOccupiedDebounceDelay(NODECONFIG.read16(EEADDR(TOTIs[i].notOccupiedDelay)));

    toti[i]->setTestStopEventIndex(TEST_EVENT_STOP);

    // toti[i]->print();
  }

  toti[0]->setTestStartEventIndex(TEST_EVENT_TOTI1);
  toti[1]->setTestStartEventIndex(TEST_EVENT_TOTI2);
}

void initialiseI2C() {
  bool retval;
  uint8_t address = 0x70;

  //call setPins() first, so that begin() can be called without arguments from libraries
  retval = Wire.setPins(I2C_SDA, I2C_SCL);
  if (!retval) Serial.printf("\n%6ld error from setPins()", millis());

  retval = Wire.begin();
  if (!retval) Serial.printf("\n%6ld error from begin()", millis());

  if (retval) Serial.printf("\n%6ld I2C configured successfully", millis());

  // Look for I2C device.
  Wire.beginTransmission(address);
  uint8_t error = Wire.endTransmission();

  if (!error) {
    Serial.printf("\n%6ld I2C device found at address %02x", millis(), address);
  } else {
    Serial.printf("\n%6ld No I2C device found at address %02x", millis(), address);
  }
}

// Was "NodeID nodeid(NODE_ADDRESS);" which was moved here for OpenLCB_Single_Thread version 0.1.19.
// The actual value for Node ID is now set in setup() using data from Preferences or
// uses NODE_ADDRESS if not available in Preferences.
NodeID nodeid;

// The following #include needs nodeid to be already declared.
#include "OpenLCBMid.h"   // Essential - do not move or delete

/**
 * Telnet callback functions.
 */
void logMessageCallbackFunction(const char* format, ...) {
  char logMessageBuffer[200];

  // Format the log message using the provided format and arguments.
  va_list argptr;
  va_start(argptr, format);
  vsnprintf(logMessageBuffer, sizeof(logMessageBuffer), format, argptr);
  va_end(argptr);

  // Telnet needs a carriage return before the line feed to display correctly.
  telnet.print("\r");
  telnet.print(logMessageBuffer);

  // Serial monitor doesn't need the carriage return.
  Serial.print(logMessageBuffer);
}

void onTelnetConnect(String ip) {
  Serial.printf("\n%6ld [onTelnetConnect] Telnet connection from %s", millis(), ip.c_str());
  
  telnet.println("\nWelcome " + telnet.getIP());
  telnet.println("\nThis is an LCC node with the following configuration;-");

  telnet.println("\n            Model: " + String(MODEL));
  char charNodeID[30] = "";
  sprintf(charNodeID, "%02X.%02X.%02X.%02X.%02X.%02X", nodeid.val[0], nodeid.val[1], nodeid.val[2], nodeid.val[3], nodeid.val[4], nodeid.val[5]);

  telnet.println("          Node ID: " + String(charNodeID));
  telnet.println(" Software version: " + String(SWVERSION));
  telnet.println(" Compilation date: " + String(__DATE__));
  telnet.println(" Compilation time: " + String(__TIME__));

  telnet.println("\n(Use CTRL+] + q  to disconnect)");
}

void onTelnetDisconnect(String ip) {
  Serial.printf("\n%6ld [onTelnetDisconnect] Telnet connection from %s closed", millis(), ip.c_str());
}

void initialiseTelnet() {
  telnet.begin();

  telnet.onConnect(onTelnetConnect);
  telnet.onDisconnect(onTelnetDisconnect);

  Serial.printf("\n%6ld Telnet server started", millis());
}

// ==== Setup does initial configuration ======================
void setup() {
  Serial.begin(115200);

  // Delay to allow Serial port to be established.
  delay(1000);

  // temp for testing -- allows CoolTerm to be connected.
  // delay(4000);

  Serial.printf("\n%6ld starting program", millis());
  Serial.printf("\n%6ld            Model: ", millis()); Serial.print(MODEL);
  Serial.printf("\n%6ld Software version: ", millis()); Serial.print(SWVERSION);
  Serial.printf("\n%6ld Compilation date: ", millis()); Serial.print(__DATE__);
  Serial.printf("\n%6ld Compilation time: ", millis()); Serial.print(__TIME__);

  // Create a ConfigurationOTA object and pass in the required parameters.
  ConfigurationOTA configurationOTA;
  configurationOTA.setCredentials(credentials); // A pointer to the credentials data in credentials.h
  configurationOTA.setTimeout(2000); // The 1000 mS timeout is used when connecting to one of potentially many WiFi hubs as not every WiFi hub may be available
  configurationOTA.setCurrentVersion(SWVERSION); // The currently running version of firmware
  configurationOTA.setDefaultNodeID(NodeID(NODE_ADDRESS)); // Used if a Node ID cannot be obtained   ==== required ???? ====

  // Connect to a WiFi network, download the json configuration file and perform all configuration.
  configurationOTA.doConfiguration();

  // Update nodeid according to the Node ID stored in Preferences.
  // If there is no Node ID stored, then use the default of NODE_ADDRESS.
  nodeid = ConfigurationPreferences::getNodeID(NodeID(NODE_ADDRESS));

  // Initialise Olcb with the node id from Preferences.
  Olcb_init(nodeid, RESET_TO_FACTORY_DEFAULTS);

