JohnCallingham/ESP32_2Servo_2Frog_2TOTI_WiFi/src/main.cpp
  initialiseRGBLEDs();
  initialiseServos();
  initialiseCrossover();
  initialiseFrogs();
  initialiseTOTIs();
  initialiseI2C();
  initialiseTelnet();

  Serial.printf("\n%6ld Initialisation finished", millis());
}

// ==== Loop ==========================
void loop() {
  // Do OpenLCB/LCC processing.
  Olcb_process();

  // Process any servo actions.
  for (uint8_t i=0; i<NUM_SERVO; i++) {
    servo[i]->loop();
  }

  // process any crossover actions.
  crossover.loop();

  // Process any frog timeouts.
  for (uint8_t i=0; i<NUM_FROG; i++) {
    frog[i]->loop();
  }

  // process any changes to TOTI state and send the appropriate event if required.
  for (uint8_t i=0; i<NUM_TOTI; i++) {
    toti[i]->loop();
  }

  // Process any telnet actions.
  telnet.loop();

  /**
   * Connect to the OpenLCB/LCC hub and reconnect if contact has been lost.
   */
  if (hubConnectionMade(ConfigurationPreferences::getWiFiSSID(), ConfigurationPreferences::getWiFiPassword())) {
    ledConfigHubConnected = true; // Turn the blue LED on if configured.

    // This is required so that JMRI is initialised if JMRI starts after the node has started.
    sendInitialEvents();
  }

  if (hubConnectionLost(ConfigurationPreferences::getWiFiSSID(), ConfigurationPreferences::getWiFiPassword())) {
    ledConfigHubConnected = false; // Turn the blue LED off if configured.
  }

  /**
   * Control the LEDs.
   */
  digitalWrite(LED_RED, getLEDState(ledRedConfiguration));
  digitalWrite(LED_GREEN, getLEDState(ledGreenConfiguration));
  digitalWrite(LED_BLUE, getLEDState(ledBlueConfiguration));
}

/**
 * Returns LOW or HIGH to control one of the RGB LEDs.
 */
uint8_t getLEDState(int switchInput) {
  uint8_t ledState;

  switch (switchInput) {
    case LED_CONFIG_NOT_CONFIGURED:
      ledState = HIGH;
      break;
    case LED_CONFIG_HUB_STATE:
      ledState = ledConfigHubConnected ? LOW : HIGH;
      break;
    case LED_CONFIG_TOTI_1_STATE:
      ledState = toti[0]->isOccupied() ? LOW : HIGH;
      break;
    case LED_CONFIG_TOTI_2_STATE:
      ledState = toti[1]->isOccupied() ? LOW : HIGH;
      break;
    case LED_CONFIG_FROG_1_J_CONNECTED:
      ledState = frog[0]->isConnectedJ() ? LOW : HIGH;
      break;
    case LED_CONFIG_FROG_1_K_CONNECTED:
      ledState = frog[0]->isConnectedK() ? LOW : HIGH;
      break;
    case LED_CONFIG_FROG_2_J_CONNECTED:
      ledState = frog[1]->isConnectedJ() ? LOW : HIGH;
      break;
    case LED_CONFIG_FROG_2_K_CONNECTED:
      ledState = frog[1]->isConnectedK() ? LOW : HIGH;
      break;
    case LED_CONFIG_SERVO_1_THROWN:
      ledState = servo[0]->isThrown() ? LOW : HIGH;
      break;
    case LED_CONFIG_SERVO_1_CLOSED:
      ledState = servo[0]->isClosed() ? LOW : HIGH;
      break;
    case LED_CONFIG_SERVO_2_THROWN:
      ledState = servo[1]->isThrown() ? LOW : HIGH;
      break;
    case LED_CONFIG_SERVO_2_CLOSED:
      ledState = servo[1]->isClosed() ? LOW : HIGH;
      break;
    case LED_CONFIG_CROSSOVER_THROWN:
      ledState = crossover.isThrown() ? LOW : HIGH;
      break;
    case LED_CONFIG_CROSSOVER_CLOSED:
      ledState = crossover.isClosed() ? LOW : HIGH;
      break;
  }
  
  return ledState;
}

// void specialDatagramReceived() {
//   Serial.printf("\nSpecial datagram received");
// }

char displayMemory[100];

void writeDisplayMemory(uint32_t address, uint8_t val) {
  Serial.printf("\nwriteDisplayMemory(). address=%d, val=%d", address, val);
  // Need to check that we don't write off the end!!
  displayMemory[address] = val;
}
